In [82]:
import pandas as pd

# Manually Extracted the dataset from SEC's EDGAR's databse

In [84]:
df = pd.read_csv('final_report.csv')

In [85]:
df

,Year,Total Revenue,Net Income,Total Assets,Total Liabilities,Cash Flow from Operating Activities,Company
0,2025,281724,101832,619003,275524,136162,Microsoft
1,2024,245122,88136,512163,243686,118548,Microsoft
2,2023,211915,72361,411976,205753,87582,Microsoft
3,2024,97690,7153,122070,48390,14923,Tesla
4,2023,96773,14974,106618,43009,13256,Tesla
5,2022,81462,12587,82338,36440,14724,Tesla
6,2025,416161,112010,359241,285508,111482,Apple
7,2024,391035,93736,364980,308030,118254,Apple
8,2023,383285,96995,352583,290437,110543,Apple

In [86]:
df['Revenue Growth (%)'] = df.groupby('Company')['Total Revenue'].pct_change() * 100
df['Net Income Growth (%)'] = df.groupby('Company')['Net Income'].pct_change() * 100

In [87]:
df

,Year,Total Revenue,Net Income,Total Assets,Total Liabilities,Cash Flow from Operating Activities,Company,Revenue Growth (%),Net Income Growth (%)
0,2025,281724,101832,619003,275524,136162,Microsoft,NaN,NaN
1,2024,245122,88136,512163,243686,118548,Microsoft,-12.992148,-13.449603
2,2023,211915,72361,411976,205753,87582,Microsoft,-13.547132,-17.898475
3,2024,97690,7153,122070,48390,14923,Tesla,NaN,NaN
4,2023,96773,14974,106618,43009,13256,Tesla,-0.938684,109.338739
5,2022,81462,12587,82338,36440,14724,Tesla,-15.821562,-15.940964
6,2025,416161,112010,359241,285508,111482,Apple,NaN,NaN
7,2024,391035,93736,364980,308030,118254,Apple,-6.037567,-16.314615
8,2023,383285,96995,352583,290437,110543,Apple,-1.981920,3.476786

# Imputing the null values with 0

In [89]:
df.fillna(0, inplace=True)

In [90]:
df

,Year,Total Revenue,Net Income,Total Assets,Total Liabilities,Cash Flow from Operating Activities,Company,Revenue Growth (%),Net Income Growth (%)
0,2025,281724,101832,619003,275524,136162,Microsoft,0.000000,0.000000
1,2024,245122,88136,512163,243686,118548,Microsoft,-12.992148,-13.449603
2,2023,211915,72361,411976,205753,87582,Microsoft,-13.547132,-17.898475
3,2024,97690,7153,122070,48390,14923,Tesla,0.000000,0.000000
4,2023,96773,14974,106618,43009,13256,Tesla,-0.938684,109.338739
5,2022,81462,12587,82338,36440,14724,Tesla,-15.821562,-15.940964
6,2025,416161,112010,359241,285508,111482,Apple,0.000000,0.000000
7,2024,391035,93736,364980,308030,118254,Apple,-6.037567,-16.314615
8,2023,383285,96995,352583,290437,110543,Apple,-1.981920,3.476786

# Calculating Year-by-Year (YOY) growth for Total Assests/Liabilities and Cash flow

In [92]:
df['Assets Growth(%)'] = df.groupby('Company')['Total Assets'].pct_change()*100
df['Liabilities Growth(%)'] = df.groupby('Company')['Total Liabilities'].pct_change()*100
df['Cash Flow Growth(%)'] = df.groupby('Company')['Cash Flow from Operating Activities'].pct_change()*100

In [93]:
df

,Year,Total Revenue,Net Income,Total Assets,Total Liabilities,Cash Flow from Operating Activities,Company,Revenue Growth (%),Net Income Growth (%),Assets Growth(%),Liabilities Growth(%),Cash Flow Growth(%)
0,2025,281724,101832,619003,275524,136162,Microsoft,0.000000,0.000000,NaN,NaN,NaN
1,2024,245122,88136,512163,243686,118548,Microsoft,-12.992148,-13.449603,-17.260013,-11.555436,-12.936061
2,2023,211915,72361,411976,205753,87582,Microsoft,-13.547132,-17.898475,-19.561546,-15.566344,-26.121065
3,2024,97690,7153,122070,48390,14923,Tesla,0.000000,0.000000,NaN,NaN,NaN
4,2023,96773,14974,106618,43009,13256,Tesla,-0.938684,109.338739,-12.658311,-11.120066,-11.170676
5,2022,81462,12587,82338,36440,14724,Tesla,-15.821562,-15.940964,-22.772890,-15.273547,11.074231
6,2025,416161,112010,359241,285508,111482,Apple,0.000000,0.000000,NaN,NaN,NaN
7,2024,391035,93736,364980,308030,118254,Apple,-6.037567,-16.314615,1.597535,7.888395,6.074523
8,2023,383285,96995,352583,290437,110543,Apple,-1.981920,3.476786,-3.396624,-5.711457,-6.520710

In [94]:
df.fillna(0, inplace=True)

In [95]:
df

,Year,Total Revenue,Net Income,Total Assets,Total Liabilities,Cash Flow from Operating Activities,Company,Revenue Growth (%),Net Income Growth (%),Assets Growth(%),Liabilities Growth(%),Cash Flow Growth(%)
0,2025,281724,101832,619003,275524,136162,Microsoft,0.000000,0.000000,0.000000,0.000000,0.000000
1,2024,245122,88136,512163,243686,118548,Microsoft,-12.992148,-13.449603,-17.260013,-11.555436,-12.936061
2,2023,211915,72361,411976,205753,87582,Microsoft,-13.547132,-17.898475,-19.561546,-15.566344,-26.121065
3,2024,97690,7153,122070,48390,14923,Tesla,0.000000,0.000000,0.000000,0.000000,0.000000
4,2023,96773,14974,106618,43009,13256,Tesla,-0.938684,109.338739,-12.658311,-11.120066,-11.170676
5,2022,81462,12587,82338,36440,14724,Tesla,-15.821562,-15.940964,-22.772890,-15.273547,11.074231
6,2025,416161,112010,359241,285508,111482,Apple,0.000000,0.000000,0.000000,0.000000,0.000000
7,2024,391035,93736,364980,308030,118254,Apple,-6.037567,-16.314615,1.597535,7.888395,6.074523
8,2023,383285,96995,352583,290437,110543,Apple,-1.981920,3.476786,-3.396624,-5.711457,-6.520710

# Exporting the Analyzed dataset

In [97]:
df.to_csv('analyzed.csv')

# Summarizing

In [101]:
summary = df.groupby('Company').agg({
    'Revenue Growth (%)': 'mean',
    'Net Income Growth (%)': 'mean',
    'Assets Growth(%)': 'mean',
    'Liabilities Growth(%)': 'mean',
    'Cash Flow Growth(%)' :'mean'  
}).reset_index()

In [103]:
print('Year-by-Year Average growth rates(%): ->')
summary

Year-by-Year Average growth rates(%): ->

,Company,Revenue Growth (%),Net Income Growth (%),Assets Growth(%),Liabilities Growth(%),Cash Flow Growth(%)
0,Apple,-2.673162,-4.279276,-0.599697,0.725646,-0.148729
1,Microsoft,-8.846427,-10.449359,-12.273853,-9.040593,-13.019042
2,Tesla,-5.586748,31.132592,-11.810400,-8.797871,-0.032149

# Eporting the summarized report

In [105]:
summary.to_csv('Summarized_report.csv')